<a href="https://colab.research.google.com/github/kdstheace/Python-Study/blob/main/Day0329_Pandas_GroupBy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **GroupBy의 사용**
- SQL문의 groupby와 유사

In [3]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [4]:
data = DataFrame({
    '부서' : ["영업1팀", "영업1팀", "영업2팀", "해외영업팀", "해외영업팀","영업1팀",\
            "해외영업팀", "영업1팀", "해외영업팀", "영업2팀", "영업2팀", "해외영업팀"],
    '순위' : [1, 2, 1, 3, 2, 1, 1, 1, 3, 2, 1, 2],
    '연도' : [2014, 2015, 2016, 2014, 2017, 2015, 2014, 2019, 2017, 2016, 2015, 2015],
    '매출액' : [876, 788, 900, 670, 770, 910, 760, 980, 910, 800, 877, 788]

})
data

       부서  순위    연도  매출액
0    영업1팀   1  2014  876
1    영업1팀   2  2015  788
2    영업2팀   1  2016  900
3   해외영업팀   3  2014  670
4   해외영업팀   2  2017  770
5    영업1팀   1  2015  910
6   해외영업팀   1  2014  760
7    영업1팀   1  2019  980
8   해외영업팀   3  2017  910
9    영업2팀   2  2016  800
10   영업2팀   1  2015  877
11  해외영업팀   2  2015  788